pehill-cases-OpenFOAM/case_1p2/0/Tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(2.60044e-09 1.78365e-11 4.05016e-41 2.60041e-09 8.05973e-36 2.60043e-09)
(2.73255e-09 1.91054e-11 5.18165e-35 2.73252e-09 -6.64838e-32 2.73253e-09)
(2.87538e-09 2.05098e-11 -1.81056e-33 2.87536e-09 -2.35397e-33 2.87537e-09)
(3.02402e-09 2.19298e-11 3.59638e-33 3.02401e-09 2.97941e-33 3.02401e-09)
(3.18092e-09 2.34379e-11 -1.80024e-33 3.18091e-09 2.18805e-33 3.18091e-09)
(3.34562e-09 2.49758e-11 2.62231e-35 3.34561e-09 -4.97765e-33 3.34561e-09)
(3.51521e-09 2.65265e-11 -7.52955e-35 3.51521e-09 -1.10776e-31 3.51521e-09)
(3.69224e-09 2.81131e-11 1.15693e-33 3.69225e-09 6.66735e-35 3.69225e-09)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 -0 0 6.66667e-16 -0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 -0 6.66667e-16);
    }
}


// ************************************************************************* //
