pehill-cases-OpenFOAM/case_1p2/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(4.818111256808933663e-07 4.976770580462027179e-09 0.000000000000000000e+00 3.966581082310552975e-10 0.000000000000000000e+00 1.684705439692685731e-07)
(4.803837997527108333e-07 5.092217418693745022e-09 0.000000000000000000e+00 4.054035360368200737e-10 0.000000000000000000e+00 1.713523257413663538e-07)
(4.788356817614690882e-07 5.204900997027836657e-09 0.000000000000000000e+00 4.142874332413786791e-10 0.000000000000000000e+00 1.739466986992469851e-07)
(4.772437324414615969e-07 5.316246587287890282e-09 0.000000000000000000e+00 4.252353247483858547e-10 0.000000000000000000e+00 1.765005816307283294e-07)
(4.757805047638135132e-07 5.423802294120250626e-09 0.000000000000000000e+00 4.365058262927799909e-10 0.000000000000000000e+00 1.789246188473659765e-07)
(4.743750621370196735e-07 5.529069604167445209e-09 0.000000000000000000e+00 4.479442651849855859e-10 0.000000000000000000e+00 1.812113547279720978e-07)
(4.730771718789556138e-07 5.621673539008748255e-09 0.000000000000000000e+00 4.596541766960865386e-10 0.000000000000000000e+00 1.835588261689065358e-07)
(4.718488324919525319e-07 5.712006568736581113e-09 0.000000000000000000e+00 4.733226073406913824e-10 0.000000000000000000e+00 1.859584267771456750e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}