pehill-cases-OpenFOAM/case_1p2/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
3.94788e-05
3.94754e-05
3.94731e-05
3.94735e-05
3.94766e-05
3.94787e-05
3.94801e-05
3.94812e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0098703
0.00987296
0.00993366
0.01019
0.0107535
0.0113723
0.0118386
0.0120934
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0098703
0.0098703
0.0098703
0.0098703
0.0098703
0.0098703
0.0098703
0.0098703
...
)
;
    }
}


// ************************************************************************* //
